import streamlit as st

def feature_insight():
    st.write('## 인사이트 도출')
    st.write('#### 1. 승리는 특정 지표가 만드는 것이 아니다.')
    st.write('1-1. 대부분의 지표가 승점과의 상관계수 값이 0.5보다 낮다.')
    st.write('1-2. 승리에 더 깊게 기여하는 지표가 존재한다.')
    st.write('1-3. 승점 예측 모델의 경우 특정 지표로 예측하는 것 보다 많은 지표로 예측하는 것이 정확도가 높다.')
    st.write('1-4. 수치적으로 표현하기 힘든 선수의 컨디션, 소통능력 등의 지표가 팀 승리에 영향을 준다.')
    st.write('1-5. 수치로 표현하기 힘든 요소들이 스포츠를 더 즐겁게 만들 것이다.')
    st.write('')
    st.write('#### 2. 전체적인 결과를 고려했을 때 패스 성공률이 중요하다.')
    st.write('2-1. 팀 자체적으로 패스 관련 훈련이 필요하다.')
    st.write('2-2. 선수들은 서로 패스를 할 때 더 집중하고 팀원들과의 합을 맞추는데 집중해야된다.')
    st.write('')
    st.write('#### 3. 수비수의 경우 다른 포지션에 비해 수치적으로 판단하기 힘들다.')
    st.write('')
    st.write('#### 4. 골키퍼는 경기당 실점, 클린시트 횟수 등 추가적인 데이터가 필요하다.')